app/views/shared/_navbar.html.erb

                <ul>
                  <% @current_cart.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1  [["cart_id", 5]]