app/views/carts/show.html.erb

          <ul>
          <% @cart.items.each do |i| %>
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1 ORDER BY "items"."id" ASC LIMIT $2  [["cart_id", 6], ["LIMIT", 1]]

        </ul>
        <% if @cart.items.first.nil? %>
---
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1 LIMIT $2  [["cart_id", 6], ["LIMIT", 11]]