app/controllers/carts_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-12-03 17:34:26.031777"], ["updated_at", "2020-12-03 17:34:26.031777"]]
---
  def create
    @cart = Cart.new(cart_params)
    authorize @cart, policy_class: CartPolicy
    respond_to do |format|
      if @cart.save

DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 5]]
---
  def destroy
    authorize @cart, policy_class: CartPolicy
    @cart.destroy