app/controllers/catches_controller.rb

SELECT "catches".* FROM "catches"
---
  def index
    @catches = if current_user.admin?
                 Catch.all