app/controllers/fish_controller.rb

  def index
    @fish = Fish.all
---
SELECT "fish".* FROM "fish"

  def create
    @fish = Fish.new(fish_params)

    respond_to do |format|
      if @fish.save
---
INSERT INTO "fish" ("scientific", "english", "lebanese", "water", "texture", "flavor", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @fish.update(fish_params)
---
UPDATE "fish" SET "image" = $1 WHERE "fish"."id" = $2  [["image", "image/upload/v1606662021/Fish.png"], ["id", 3]]

  def destroy
    @fish.destroy
---
DELETE FROM "fish" WHERE "fish"."id" = $1  [["id", 3]]

    def set_fish
      @fish = Fish.find(params[:id])
---
SELECT "fish".* FROM "fish" WHERE "fish"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]