app/controllers/items_controller.rb

INSERT INTO "items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 1], ["cart_id", 5], ["created_at", "2020-12-03 16:35:45.476103"], ["updated_at", "2020-12-03 16:35:45.476103"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]
---
  def destroy
    session[:return_to] ||= request.referer
    @item.destroy