app/controllers/pages_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-12-03 14:06:22.909752"], ["updated_at", "2020-12-03 14:06:22.909752"]]
---
  def current_cart
    if session[:cart_id] && !Cart.find(session[:cart_id]).nil?
      @current_cart ||= Cart.find(session[:cart_id])
    end
    if session[:cart_id].nil?
      @current_cart = Cart.create(user_id: current_user.id)

SELECT "products".* FROM "products"
---
  def market
    @products = Product.all