app/controllers/products_controller.rb

INSERT INTO "products" ("catch_id", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["catch_id", 2], ["price", 11], ["created_at", "2020-12-04 09:37:29.193776"], ["updated_at", "2020-12-04 09:37:29.193776"]]
---
  def create
    session[:return_to] ||= request.referer
    @product = Product.new(product_params)
    if @product.user_id.nil?
      @product.user_id = current_user.id
    end
    authorize @product, policy_class: ProductPolicy
    respond_to do |format|
      if @product.save