app/controllers/users/sessions_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."cart_id" = $1  [["cart_id", 9]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 7]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 11]]
---
    def destroy
      unless session[:cart_id].nil?
        @current_cart ||= Cart.find(session[:cart_id])
        unless @current_cart.items.first.nil?
          @current_cart.items.each(&:destroy)
          @current_cart.destroy