app/views/fish/index.html.erb

SELECT "fish".* FROM "fish"
SELECT COUNT(*) FROM "fish"
---

<h1>Fish (<%= Fish.all.count %>)</h1>